project-root/app/Models/BooksModel.php

    public function getBuku($slug = false)
    {
        if ($slug == false) {
            return $this->findAll();
        }

        return $this->where(['slug' => $slug])->first();
---
SELECT *
FROM `books`
SELECT *
FROM `books`
WHERE `slug` = 'sword-art-ngawi'
 LIMIT 1